package com.example.gallery


val surf:  String = "Летняя школа Surf\n" +
            "В приятной и дружелюбной атмосфере прошла первая лекция летней школы от компании Surf." +
            "Было очень интересно и познавательно. Это смотивировало на изучение языков Kotlin и Java,"+
            "а также на освоение Android Studio. Благодаря отличным рассказчикам появилось желание возобновить" +
            "занятия программированием и разработку мобильных приложений."

val korgi: String =
            "Вельш-корги – собака для детей, кинологического спорта и активной жизни в городе и на природе." +
            "Короткие лапы не мешают ей быстро двигаться. А высокий интеллект и умение работать в команде" +
            "делают прекрасным компаньоном. Вдобавок порода относится к семейству овчарок. Поэтому если вы" +
            "мечтали об умном и исполнительном питомце, который легко поддается дрессировке, но при этом" +
            "неагрессивен к человеку, включая детей дошкольного возраста, рассмотрите породу корги одной" +
            "из первых.\n" + "\n" +

            "Размер: малый\n" +
            "Шерсть: средняя жесткая\n" +
            "Вес: 9-12 кг\n" +
            "Рост в холке: 25-30 см\n" +
            "Средняя продолжительность жизни: 12-15 лет\n" +
            "Потребность в прогулке: 1-1,5 часа в день\n" +
            "\n" +
            "Ключевые качества\n" +
            "–Дружелюбность. Вельш-корги не проявляют агрессию ни к людям, ни другим животным. Однако в" +
            "незнакомой для себя обстановке становятся осторожными и чуть напряженными.\n"+
            "– Активность. Собака стремится находиться в центре событий: любит бегать, играть в мяч " +
            "и участвовать в кинологических видах спорта. Например, аджилити, фрисби, флайбол.\n"  +
            "– Развитый интеллект. Порода вельш-корги занимает 10-ю строчку в рейтинге самых умных " +
            "пород собак по шкале Корена. Однако по скорости обучения и послушанию может конкурировать" +
            " с его победителем – собакой бордер-колли.\n" +
            "– Привязанность к человеку. Вельш-корги легко адаптируются к жизни в большой семье, любят " +
            "проводить время в большой компании, готовы сопровождать хозяина в людных местах.\n" +
            "– Высокий уровень эмпатии. Собака тонко чувствует настроение хозяев, легко угадывая, когда " +
            "можно пригласить игре, а когда держаться на расстоянии.\n" +
            "– Устойчивая пищевая мотивация. Вельш-корги мотивированы работать за угощение в любом возрасте," +
            " поэтому остаются управляемыми даже в период полового созревания.\n" +
            "– Врожденный пастуший инстинкт. Собаки сохранили привычку оббегать свою цель сзади и щипать за" +
            " ноги. Инстинкт работает и в отношении других животных, и человека. Но избавиться от него несложно." +
            " Главное – корректировать поведение питомца с раннего детства.\n" +
            "– Низкая склонность к лаю. Вельш-корги не подает голос без объективной причины и спокойно ждет" +
            " хозяев с работы дома, не мешая соседям." +
            "– Смелость. Собака с интересом подходит к более крупным сородичам на улице и без робости" +
            " знакомится с новыми людьми.\n" +
            "– Выносливость. С корги можно ходить на долгие прогулки, и он не будет проситься на руки и искать " +
            "место для отдыха. Несмотря на короткие лапы и декоративную внешность, собака крепко сложена и " +
            "выдерживает серьезные нагрузки.\n" +
            "– Выраженная сезонная линька. Корги сильно линяют весной и осенью. В этот период шерсть нуждается" +
            " в постоянном уходе: собаку вычесывают дома или обращаются за процедурой «экспресс-линька» к " +
            "профессиональному грумеру.\n" +
            "– Подходит в качестве первого питомца. Порода вельш-корги легко поддается дрессировке и, в отличие" +
            " от более крупных овчарок, не нуждается в строгом авторитарном воспитании.\n" +
            "– Подходит семьям с детьми. Корги не проявляют агрессию и не боятся громких звуков."+ "\n" +"\n" +

            "Характер\n" +

            "Вельш-корги – игривые и общительные собаки, всюду следующие за хозяином. Эти качества " +
            "считаются породообразующими и проявятся абсолютно у любого представителя породы вне " +
            "зависимости от воспитания и условий содержания. Но чтобы описать характер корги детальнее," +
            " нужно учитывать его подвид. Ведь пемброки отличаются от кардиганов не только экстерьером," +
            " но и поведением.\n" +
            "\n" +
            "Вельш-корги-пемброк более активны и дружелюбны, легко идут на контакт с незнакомыми людьми" +
            " и любят привлечь к себе внимание: сесть в ногах и дотрагиваться до хозяина лапой, пока их " +
            "не заметят. По уровню эмоциональности и чувствительности сильно превосходят кардиганов. Могут " +
            "вести себя экспрессивно и отвлекаться во время дрессировок. Особенно если не получают достаточной" +
            " физической нагрузки в виде подвижных игр и долгих прогулок.\n" +
            "\n" +
            "Вельш-корги-кардиган спокойнее и уравновешеннее. В компании незнакомых людей становятся" +
            " настороженными. Обладают большей выдержкой и самостоятельностью. Поэтому легче поддаются" +
            " дрессировке и способны проводить длительное время в одиночестве. При этом не теряют " +
            "привязанности к семье и в любой момент готовы составить своим домашним компанию."

val cake:  String =
            "Ингредиенты\n" + "\n" +
            "Куриное яйцо\t\t\t\t" + "2 штуки\n" +
            "Сахар\t\t\t\t" + "1 стакан\n" +
            "Какао\t\t\t\t" + "½ стакана\n" +
            "Пшеничная мука\t\t\t\t" + "2 стакана\n" +
            "Сливочное масло\t\t\t\t" + "150 г\n" +
            "Ванильный экстракт\t\t\t\t" + "1 чайная ложка\n" +
            "Разрыхлитель\t\t\t\t" + "1 чайная ложка\n" +
            "Соль\t\t\t\t" + "щепотка\n" +"\n" +
            "Инструкция приготовления\n\n" +
            "1. Смешать сухие ингредиенты — муку просеять с какао-порошком, добавить разрыхлитель, соль.\n"+
            "2. Яйца взбить с сахаром до пышной пены около 5 минут. Добавить масло комнатной температуры. Добавить ваниль. Взбить хорошо.\n" +
            "3. Постепенно вмешать сухие ингредиенты. Получившееся тесто укрыть пленкой и поставить на 1 час в холод.\n" +
            "4. Разогреть духовку до 180 градусов.\n" +
            "5. Противень застелить пергаментной бумагой. Выкладывать чайной ложкой небольшие печеньица.\n" +
            "6. Выпекать около 8 минут. Дать остыть печенью на противне несколько минут, так как оно слишком мягкое. Снять с противня.\n"

val cofe: String =
            "Кофе — один из самых популярных напитков в мире (второй после чая). Первые упоминания о " +
            "нем датированы XV веком. Кофе, к которому мы привыкли, изобрели в Турции: измельченные обжаренные" +
            " зерна варили в сосуде далла (аналог современной турки), напиток имел название «канва». Через два" +
            " века оно трансформировалось в привычное нам «кофе»."

val cart: String =
            "Первая линия метрополитена длиной 6 км была построена в Лондоне. Запущена 10 января 1863 года. " +
            "Изначально первая линия в Лондоне эксплуатировалась на паровой тяге, которая начиная с 1890 года " +
            "заменялась на электрическую.\n" + "\n" +
            "Второй метрополитен был открыт в Нью-Йорке в 1868 как надземный, однако первые надземные участки " +
            "не сохранились и впоследствии были заменены подземными (первая подземная линия открыта в 1904).\n" + "\n" +
            "6 июня 1892 — открыта первая надземная линия метрополитена Чикаго на паровой тяге.\n" + "\n" +
            "В Европе старейшими после Лондонского метрополитена являются метрополитены Будапешта (1896), " +
            "Глазго (1896), Парижа (1900), Берлина (1902), Гамбурга (1912).\n" + "\n" +
            "Иногда к числу старейших метрополитенов Европы причисляют стамбульский «Тюнель» " +
            "(европейская часть города, 1875), несмотря на то что он является, по сути, подземным " +
            "фуникулёром (полноценный Стамбульский метрополитен открылся только в 2000 году), и Афинский " +
            "метрополитен, который, однако же, в момент открытия (1869) представлял собой обычный городской" +
            " поезд; в 1904 году линия была электрифицирована с использованием третьего рельса, с этого" +
            " момента её хоть как-то можно причислять к метрополитенам. Также не относится к числу " +
            "старейших и Венский метрополитен: в 1898 году в Вене открылась городская железная дорога," +
            " а в 1966 году — подземный трамвай, лишь в 1976 году ставший основой полноценного метрополитена.\n" + "\n" +
            "В России первая линия метрополитена была торжественно открыта в Москве 15 мая 1935 года." +
            " На территории СССР метрополитен был открыт также в Ленинграде (1955), Киеве (1960), Тбилиси " +
            "(1966), Баку (1967), Харькове (1975), Ташкенте (1977), Ереване (1981), Волгограде (скоростной" +
            " трамвай) и Минске (1984), Горьком (1985), Новосибирске (1986), Куйбышеве (1987) и Свердловске (1991).\n" + "\n" +
            "После распада СССР метрополитен был открыт всего лишь в трёх бывших советских городах: " +
            "Днепропетровске (1995, Украина), Казани (2005, Россия) и Алма-Ате (2011, Казахстан)."

val navigator: String =
        "Современные автомобильные навигаторы способны прокладывать маршрут с учётом организации дорожного" +
                " движения и осуществлять адресный поиск. Они могут обладать обширной базой объектов" +
                " инфраструктуры, которая служит для быстрого поиска пунктов общественного питания, " +
                "автозаправочных станций, мест для стоянок и отдыха. Некоторые модели способны принимать" +
                " и учитывать при прокладке маршрута информацию о ситуации на дорогах, по возможности " +
                "избегая серьёзных транспортных заторов. Данные о пробках могут быть получены навигатором" +
                " посредством мобильной связи (по протоколу GPRS), или из радиоэфира по каналам RDS диапазона FM.\n" + "\n" +
                "Помимо GPS-навигаторов в продаже есть устройства, способные одновременно работать и" +
                " с GPS, и с ГЛОНАСС. Массовое производство двухсистемных навигаторов началось в мае" +
                " 2010-го года: в продаже одновременно появились навигаторы Lexand SG-555 и Explay GN-510." +
                " Сегодня модели с поддержкой ГЛОНАСС и GPS есть в продуктовых линейках Explay, Lexand, " +
                "Prestigio, Prology и некоторых других торговых марок. Доля таких устройств в общем годовом" +
                " объёме продаж навигаторов достигает 6,6 %."